In [4]:
import pandas as pd
import numpy as np
from numpy import random #opcion A importas random y cuando llamas a la funcion pones random.funcion

#Otra opcion es decir "from numpy.random import randn" y llamas directamente a la funcion

In [23]:
df = pd.DataFrame(random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

#lo de .split es para que me lo separe con comas, ver ejemplo de abajo tenes que agregar coma y comillas a cada letra

          W         X         Y         Z
A  0.301502 -0.476877  1.924759  0.567711
B  1.637348 -1.720935 -2.319107  0.117153
C -0.506544  0.382301 -0.532267 -0.822787
D  1.957181  1.277487 -0.452410 -0.795238
E -0.412601 -0.540603 -0.852674 -2.009965

In [14]:
indx=["A","B","C"] 
col=[1,2,3]
df2=pd.DataFrame(random.randn(3,3),indx,col)  
#fijate que cada vez que corres el codigo agrega numeros nuevos aleatorios
df2

          1         2         3
A -1.459293  0.946338  0.292443
B -1.287004 -0.118339  0.942758
C  1.695572  0.335035  0.482997

In [46]:
d = {'col1': [1, 2], 'col2': [3, 4]}
df1 = pd.DataFrame(data=d)
df1

   col1  col2
0     1     3
1     2     4

   Selection and Indexing

In [21]:
df2[1] #grab a column       nombredataframe[columna]

A   -1.459293
B   -1.287004
C    1.695572
Name: 1, dtype: float64

In [26]:
df["W"]

A    0.301502
B    1.637348
C   -0.506544
D    1.957181
E   -0.412601
Name: W, dtype: float64

In [29]:
#si quiero mas de una columna juntas, las agrego dentro de un mismo corchete
df[["W","X"]]

          W         X
A  0.301502 -0.476877
B  1.637348 -1.720935
C -0.506544  0.382301
D  1.957181  1.277487
E -0.412601 -0.540603

Seleccionar filas

In [34]:
df2.loc['A']  
#me devuelve cada uno de los valores que aparecen en la fila INDICADA CON LABEL, con la columna respectiva

1   -1.459293
2    0.946338
3    0.292443
Name: A, dtype: float64

In [35]:
df.iloc[2]  #me devuelve la fila indicada con POSICION desde cero.

W   -0.506544
X    0.382301
Y   -0.532267
Z   -0.822787
Name: C, dtype: float64

In [38]:

df3=pd.DataFrame(random.randn(3,3),col,indx)

In [39]:
df3

          A         B         C
1 -0.659780 -0.036869  1.093536
2  0.498271 -0.003576 -0.870396
3 -0.096084  1.426706 -0.532531

In [40]:
df3.iloc[2]  # por POSICION

A   -0.096084
B    1.426706
C   -0.532531
Name: 3, dtype: float64

In [ ]:
#OJO no confundir labels con posicion numerica cuando el index esta "nombrado" con numeros que puse

In [41]:
df3.loc[2] # por LABEL

A    0.498271
B   -0.003576
C   -0.870396
Name: 2, dtype: float64

Seleccionar una celda segun columna y fila

In [44]:
df3.loc[2,"B"] # [FILA,COLUMNA]

-0.003575698391213086

In [45]:
#Otro tipo de combinacion

df3.loc[ [1,3] , ["A","C"] ] 
#df.loc[['FILA1','FILA2'],['COLUMNA1','COLUMNA2']]

          A         C
1 -0.659780  1.093536
3 -0.096084 -0.532531

Agregar o sacar filas, columnas. Hay forma permanente o temporal

In [56]:
df['new'] = df['W'] + df['Y']

In [48]:
df.drop('new',axis=1)   #axis=0 refers to de INDEX, axis=1 refers to the COLUMS

          W         X         Y         Z
A  0.301502 -0.476877  1.924759  0.567711
B  1.637348 -1.720935 -2.319107  0.117153
C -0.506544  0.382301 -0.532267 -0.822787
D  1.957181  1.277487 -0.452410 -0.795238
E -0.412601 -0.540603 -0.852674 -2.009965

In [57]:
# si llamo devuelta a df veo que new sigue ahi, es temporal, como una consulta
df

          W         X         Y         Z       new
A  0.301502 -0.476877  1.924759  0.567711  2.226262
B  1.637348 -1.720935 -2.319107  0.117153 -0.681759
C -0.506544  0.382301 -0.532267 -0.822787 -1.038812
D  1.957181  1.277487 -0.452410 -0.795238  1.504771
E -0.412601 -0.540603 -0.852674 -2.009965 -1.265275

In [58]:
df.drop('new',axis=1,inplace=True)  #for permanent change "inplace=True"

In [59]:
df

          W         X         Y         Z
A  0.301502 -0.476877  1.924759  0.567711
B  1.637348 -1.720935 -2.319107  0.117153
C -0.506544  0.382301 -0.532267 -0.822787
D  1.957181  1.277487 -0.452410 -0.795238
E -0.412601 -0.540603 -0.852674 -2.009965